app/controllers/pins_controller.rb

SELECT  "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @pin = Pin.find(params[:id])